name: "python_tesseract"
backend: "python"
input [{
  name: "INPUT_IMAGE"
  data_type: TYPE_UINT8
  dims: [-1, -1, -1]
},
{
  name: "INPUT_LANGUAGE_ID"
  data_type: TYPE_STRING
  dims: 1
}
]

output {
  name: "OUTPUT_TEXT"
  data_type: TYPE_STRING
  dims: 1
}

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]